/*
 Localizable.strings
 CSResourceFork
 
 Created by Charles Srstka on 2/19/12.
 Copyright (c) 2012 __MyCompanyName__. All rights reserved.
 */







"Yes" = "Ja";
"No" = "Nein";

"Error" = "Fehler";
"Warning" = "Warnung";

"NOT_RSRC_FILE" = "Die Datei „%@” ist kein Ressource-Datei.";
"UNKNOWN_ERROR" = "Unbekannter Fehler";

"FORK_READ_ERROR" = "Fehler beim Lesen aus dem folgenden Ressource-Zweig: %d";
"FORK_WRITE_ERROR" = "Fehler beim Schreiben in den folgenden Ressource-Zweig: %d";

"NOT_A_READ_HANDLE" = "Aus dieser Dateiverknüpfung können keine Daten gelesen werden.";
"NOT_A_WRITE_HANDLE" = "Mit dieser Dateiverknüpfung können keine Daten geschrieben werden.";

"RES_TOO_LARGE" = "Die Größe von ‚%@‘ mit der ID %d beträgt %lu Bytes, eine Ressource kann aber keine nicht größer als %lu Bytes sein.";
"RES_DATA_TOO_LARGE" = "Die Gesamtgröße aller Ressourcen in dieser Ressource-Datei überschreitet %lu Bytes, was nicht zulässig ist.";

"TOO_MANY_TYPES" = "Eine Ressource-Datei kann nicht mehr als %lu Ressource-Typen enthalten.";

"TYPE_LIST_OFFSET_TOO_LARGE" = "Der Offset der Liste der Ressource-Typen ist %lu, das Maximum ist aber %lu.";
"NAME_LIST_OFFSET_TOO_LARGE" = "Der Offset der Liste der Ressource-Namen ist %lu, das Maximum ist aber %lu.";
"RES_NAME_OFFSET_TOO_LARGE" = "Der Offset des Namens für die Ressource ‚%@‘ mit der ID %d ist zu groß; das Maximum ist %lu.";
"RES_DATA_OFFSET_TOO_LARGE" = "Der Offset der Ressource-Daten für ‚%@‘ mit der ID %d ist zu groß; das Maximum ist %lu.";
"REF_LIST_TOO_LONG" = "Die Referenzliste für den Typ ‘%@’ ist zu lang; sie muss kürzer als %lu Bytes sein.";
"TOO_MANY_RESOURCES" = "Zu viele Ressourcen vom Typ ‚%@‘; das Maximum ist %lu.";

"INVALID_RESOURCE_TYPE" = "Ungültiger Ressource-Typ ‚%@‘.";
"INVALID_RESOURCE_ID" = "Ungültige Ressourcen-Kennung %ld; nur Werte zwischen %d und %d sind zulässig.";

"RES_DATA_NOT_FOUND" = "Ressource-Daten für ‚%@‘ mit der ID %d konnten nicht gefunden werden.";

"RES_ALREADY_EXISTS" = "Eine Ressource mit Typ ‚%@‘ and ID %d existiert bereits.";
"RES_NOT_FOUND" = "Ressource-Typ ‚%@‘ %d wurde nicht gefunden.";

"FORK_ALREADY_EXISTS" = "Der angegebene Zweig existiert bereits.";
"FORK_NOT_FOUND" = "Der angegebene Zweig existiert nicht.";

"XATTR_NOT_FOUND" = "Das erweiterte Attribut „%@” scheint nicht zu existieren.";
"XATTR_ALREADY_EXISTS" = "Ein erweitertes Attribut mit dem Namen „%@” existiert bereits.";

"INVALID_HFS_TYPE" = "Ungültiger Type „%@”.";
"INVALID_CREATOR" = "Ungültiger Creator „%@”.";

"DATA_FORK_NOT_SUPPORTED" = "Der Datenzweig wird nicht von Datei „%@“ unterstützt.";
"RSRC_FORK_NOT_SUPPORTED" = "Der Ressource-Zweig wird nicht von Datei „%@“ unterstützt.";
"XATTRS_NOT_SUPPORTED" = "Die Datei „%@“ unterstützt keine erweiterten Attribute.";
"SPECIAL_XATTR_NOT_SUPPORTED" = "Sorry, das erweiterte Sonder-Attribut „%@“ wird nicht unterstützt.";
"SPECIAL_XATTR_CANNOT_BE_RENAMED" = "Sorry, das erweiterte Sonder-Attribut „%@“ kann nicht umbenannt werden.";

"UID_NOT_FOUND" = "Ein Benutzer mit der Kennung %lu existiert nicht.";
"USER_NAME_NOT_FOUND" = "Ein Benutzer mit dem Namen „%@” existiert nicht.";

"GID_NOT_FOUND" = "Eine Gruppe mit der Kennung %lu existiert nicht.";
"GROUP_NAME_NOT_FOUND" = "Eine Gruppe mit dem Namen „%@” existiert nicht.";

// ACL stuff

"User" = "user";
"Group" = "uroup";
"Unknown" = "unknown";

"allow" = "allow";
"deny" = "deny";

"ACL_READ_DATA" = "read";
"ACL_LIST_DIRECTORY" = "list";
"ACL_WRITE_DATA" = "write";
"ACL_ADD_FILE" = "add_file";
"ACL_EXECUTE" = "execute";
"ACL_SEARCH" = "search";
"ACL_DELETE" = "delete";
"ACL_APPEND_DATA" = "append";
"ACL_ADD_SUBDIRECTORY" = "add_subdirectory";
"ACL_DELETE_CHILD" = "delete_child";
"ACL_READ_ATTRIBUTES" = "readattr";
"ACL_WRITE_ATTRIBUTES" = "writeattr";
"ACL_READ_EXTATTRIBUTES" = "readextattr";
"ACL_WRITE_EXTATTRIBUTES" = "writeextattr";
"ACL_READ_SECURITY" = "readsecurity";
"ACL_WRITE_SECURITY" = "writesecurity";
"ACL_CHANGE_OWNER" = "chown";

"ACL_FILE_INHERIT" = "file_inherit";
"ACL_DIRECTORY_INHERIT" = "directory_inherit";
"ACL_LIMIT_INHERIT" = "limit_inherit";
"ACL_ONLY_INHERIT" = "only_inherit";

"ACL_PERM_SEPARATOR" = ", ";
